In [13]:
datos = {'Nombre':['Chalio', 'Maria', 'Tin'], 
         'Calificaciones': ['100','100','90'],
        'Deportes': ['Natacion','Baseball','Basket'],
        'Materias': ['Metodos numericos','Matematicas','Java']}

In [20]:
import pandas as pd
import numpy as np

In [21]:
datos

{'Nombre': ['Chalio', 'Maria', 'Tin'],
 'Calificaciones': ['100', '100', '90'],
 'Deportes': ['Natacion', 'Baseball', 'Basket'],
 'Materias': ['Metodos numericos', 'Matematicas', 'Java']}

In [22]:
df = pd.DataFrame(datos)

In [23]:
df

   Nombre Calificaciones  Deportes           Materias
0  Chalio            100  Natacion  Metodos numericos
1   Maria            100  Baseball        Matematicas
2     Tin             90    Basket               Java

In [24]:
#Datos no validos

In [30]:
datos2 = {'Nombre':['Chalio', 'Maria', 'N/A'], 
         'Calificaciones': ['100',np.nan,'90'],
        'Deportes': ['Natacion','Baseball','N/A'],
        'Materias': ['N/A','Matematicas','Java']}
df2 = pd.DataFrame(datos2)

In [31]:
df2

   Nombre Calificaciones  Deportes     Materias
0  Chalio            100  Natacion          N/A
1   Maria            NaN  Baseball  Matematicas
2     N/A             90       N/A         Java

In [32]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Nombre          3 non-null      object
 1   Calificaciones  2 non-null      object
 2   Deportes        3 non-null      object
 3   Materias        3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [33]:
df2.describe()

       Nombre Calificaciones  Deportes     Materias
count       3              2         3            3
unique      3              2         3            3
top     Maria            100  Baseball  Matematicas
freq        1              1         1            1

In [34]:
nuevo=pd.DataFrame(df2)

In [35]:
nuevo

   Nombre Calificaciones  Deportes     Materias
0  Chalio            100  Natacion          N/A
1   Maria            NaN  Baseball  Matematicas
2     N/A             90       N/A         Java

In [36]:
nuevo = nuevo.replace(np.nan,'0')

In [37]:
nuevo

   Nombre Calificaciones  Deportes     Materias
0  Chalio            100  Natacion          N/A
1   Maria              0  Baseball  Matematicas
2     N/A             90       N/A         Java

In [41]:
nuevo2 = pd.DataFrame(df2)

nuevo2.dropna(how='any', inplace=True)

In [42]:
nuevo2

   Nombre Calificaciones  Deportes Materias
0  Chalio            100  Natacion      N/A
2     N/A             90       N/A     Java

In [43]:
#Eliminar registro buscando por columna

In [44]:
columna = df2[df2['Nombre']!='N/A']

In [45]:
columna

   Nombre Calificaciones  Deportes     Materias
0  Chalio            100  Natacion          N/A
1   Maria            NaN  Baseball  Matematicas

In [46]:
#Llenar con ceros cualquier valor NAN en el DF

In [51]:
nuevo3 = pd.DataFrame(df2)
nuevo3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Nombre          3 non-null      object
 1   Calificaciones  3 non-null      object
 2   Deportes        3 non-null      object
 3   Materias        3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [48]:
nuevo3.fillna(0,inplace=True)

In [49]:
nuevo3

   Nombre Calificaciones  Deportes     Materias
0  Chalio            100  Natacion          N/A
1   Maria              0  Baseball  Matematicas
2     N/A             90       N/A         Java

In [50]:
nuevo3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Nombre          3 non-null      object
 1   Calificaciones  3 non-null      object
 2   Deportes        3 non-null      object
 3   Materias        3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [54]:
#Convertir a numeros enteros
nuevo2['calificaciones']=nuevo2.Calificaciones.astype(int)

In [53]:
nuevo2.describe()

       calificaciones
count        2.000000
mean        95.000000
std          7.071068
min         90.000000
25%         92.500000
50%         95.000000
75%         97.500000
max        100.000000